jmeter/fuel_calculator_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Fuel Calculator DB Performance Test">
      <stringProp name="TestPlan.comments">Performance test for fuel_calculator_localization database — INSERT and SELECT on calculation_records and localization_strings</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="DB_HOST" elementType="Argument">
            <stringProp name="Argument.name">DB_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="DB_PORT" elementType="Argument">
            <stringProp name="Argument.name">DB_PORT</stringProp>
            <stringProp name="Argument.value">3306</stringProp>
          </elementProp>
          <elementProp name="DB_NAME" elementType="Argument">
            <stringProp name="Argument.name">DB_NAME</stringProp>
            <stringProp name="Argument.value">fuel_calculator_localization</stringProp>
          </elementProp>
          <elementProp name="DB_USER" elementType="Argument">
            <stringProp name="Argument.name">DB_USER</stringProp>
            <stringProp name="Argument.value">root</stringProp>
          </elementProp>
          <elementProp name="DB_PASS" elementType="Argument">
            <stringProp name="Argument.name">DB_PASS</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>

      <!-- ═══════════════════════════════════════════════════════════════
           JDBC Connection Configuration
           ═══════════════════════════════════════════════════════════════ -->
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource"
                      testname="Fuel Calculator DB Connection" enabled="true">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="checkQuery">SELECT 1</stringProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">fuelDB</stringProp>
        <stringProp name="dbUrl">jdbc:mysql://${DB_HOST}:${DB_PORT}/${DB_NAME}?useSSL=false&amp;allowPublicKeyRetrieval=true&amp;serverTimezone=UTC</stringProp>
        <stringProp name="driver">com.mysql.cj.jdbc.Driver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="password">${DB_PASS}</stringProp>
        <stringProp name="poolMax">10</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">${DB_USER}</stringProp>
      </JDBCDataSource>
      <hashTree/>

      <!-- ═══════════════════════════════════════════════════════════════
           THREAD GROUP 1 — INSERT calculation records (simulate calculations)
           10 users × 5 loops = 50 INSERT operations
           ═══════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Insert Calculation Records" enabled="true">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler"
                     testname="INSERT - Save Calculation Record" enabled="true">
          <stringProp name="dataSource">fuelDB</stringProp>
          <stringProp name="queryType">Update Statement</stringProp>
          <stringProp name="query">
            INSERT INTO calculation_records
              (distance, consumption, price, total_fuel, total_cost, language)
            VALUES
              (100.0, 8.0, 1.80, 8.0, 14.40, 'en')
          </stringProp>
          <stringProp name="queryTimeout">5000</stringProp>
          <stringProp name="resultSetMaxRows">0</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════
           THREAD GROUP 2 — SELECT localization strings (simulate language load)
           5 users × 5 loops = 25 SELECT operations
           ═══════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Select Localization Strings" enabled="true">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">3</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler"
                     testname="SELECT - Load Localization Strings EN" enabled="true">
          <stringProp name="dataSource">fuelDB</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">
            SELECT `key`, value
            FROM localization_strings
            WHERE language = 'en'
          </stringProp>
          <stringProp name="queryTimeout">5000</stringProp>
          <stringProp name="resultSetMaxRows">100</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>

        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler"
                     testname="SELECT - Load Localization Strings FR" enabled="true">
          <stringProp name="dataSource">fuelDB</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">
            SELECT `key`, value
            FROM localization_strings
            WHERE language = 'fr'
          </stringProp>
          <stringProp name="queryTimeout">5000</stringProp>
          <stringProp name="resultSetMaxRows">100</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════
           THREAD GROUP 3 — SELECT calculation records (read history)
           5 users × 3 loops = 15 SELECT operations
           ═══════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Select Calculation History" enabled="true">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">2</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">3</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler"
                     testname="SELECT - Get Calculation History" enabled="true">
          <stringProp name="dataSource">fuelDB</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">
            SELECT id, distance, consumption, price, total_fuel, total_cost, language
            FROM calculation_records
            ORDER BY id DESC
            LIMIT 10
          </stringProp>
          <stringProp name="queryTimeout">5000</stringProp>
          <stringProp name="resultSetMaxRows">10</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════
           LISTENERS — Results Tree and Aggregate Report
           ═══════════════════════════════════════════════════════════════ -->
      <ResultCollector guiclass="ViewResultsFullVisualizer"
                       testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatGraphVisualizer"
                       testclass="ResultCollector" testname="Aggregate Graph">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>